[
  {
    "name": "Audio Podcasting",
    "description": "Participants use digital audio technology to create original content for a podcast piece that addresses the annual theme. The podcast must feature high level storytelling techniques, voice acting, and fully sound effects. The full entry must include documentation of the podcast development process and elements. Semifinalists complete an onsite challenge to produce an additional podcast(s).",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Biotechnology",
    "description": "To address the annual theme, participants select a contemporary biotechnology issue and demonstrate understanding of the topic through their documented research and an original display. Semifinalists participate in an interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Career Prep",
    "description": "Based on the annual theme, participants conduct research on a technology-related career, prepare a letter of introduction to a potential employer, and develop a job-specific resume. Semifinalists participate in a mock job interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Challenging Technology Issues",
    "description": "Following the onsite random selection of a technology topic from a group of pre-conference posted topics, participants work to prepare for and deliver a debate-style presentation, in which they explain opposing views of the selected topic.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Chapter Team",
    "description": "Participants take a parliamentary procedure written test to qualify for the semifinal round of competition. Semifinalists conduct an opening ceremony, items of business, parliamentary actions, and a closing ceremony.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Children's Stories",
    "description": "Participants create an illustrated children's story based on the annual theme. The entry product is a physical storybook of artistic, instructional, and social value. Semifinalists read their story aloud and participate in an interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Coding",
    "description": "To qualify for the semifinal round of competition, participants take a written test that concentrates on computer science and coding. Semifinalists demonstrate their programming knowledge by developing a solution to an onsite coding challenge.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Community Service Video",
    "description": "Participants create a video that depicts the local TSA chapter's involvement in a community service project. Semifinalists deliver a presentation on the project and participate in an interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Computer Aided Design (CAD) Foundations",
    "description": "Participants demonstrate their understanding of CAD fundamentals by creating a two-dimensional (2-D) graphic representation of an engineering part or object and answering questions from evaluators about their entry.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Construction Challenge",
    "description": "Participants submit a scale model, display, and documentation portfolio for a design that fulfills a community need related to construction. Semifinalists deliver a presentation about their entry and participate in an interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Cybersecurity",
    "description": "Participants take a written test that assesses knowledge of cybersecurity vocabulary and the skills needed to execute common cybersecurity tasks. Using digital presentation software, semifinalists deliver a presentation that addresses the annual theme/problem.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Data Science and Analytics",
    "description": "Participants conduct research on the annual topic and analyze the provided data set, document their research in a supporting portfolio, and create a display. Semifinalist teams participate in an onsite presentation highlighting their pre-conference submission.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Digital Photography",
    "description": "Participants produce and submit a digital photographic portfolio that relates to the annual theme. Semifinalists participate in an onsite photographic challenge and a presentation/interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Dragster",
    "description": "Participants design, draw, and construct a CO2-powered dragster that adheres to the annual specifications, design and documentation requirements, and theme. Semifinalists participate in an interview and compete in a double-elimination race.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Drone Challenge (UAV)",
    "description": "Teams study the principles of flight and research the use of drones to address an annual theme. They demonstrate their knowledge of drones in manual flight missions and create a documentation portfolio. Semifinalists participate in an onsite interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Electrical Applications",
    "description": "Participants take a written test on basic electrical and electronic theory. In response to an onsite challenge, semifinalists assemble a specified circuit from a schematic diagram, make required electrical measurements, and explain their solution in an interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Flight",
    "description": "Participants submit a documentation portfolio and fabricate a glider designed to stay in flight for the greatest elapsed time. Semifinalists use their technical drawing skills to construct a glider that is flown onsite.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Forensic Technology",
    "description": "Participants take a written test of basic forensic science theory to qualify for the semifinal round of competition. Semifinalists participate in an onsite forensic skills demonstration.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Inventions and Innovations",
    "description": "To address the annual theme, participants research a need - and brainstorm a solution - for an invention or innovation of a device, system, or process. Participants document their work in an interactive display and the creation of a model/prototype. Semifinalists deliver a presentation about their work and participate in an interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Leadership Strategies",
    "description": "Participants prepare for and deliver a presentation about a specific challenge that officers of a TSA chapter might encounter. Semifinalists follow the same competition procedure but must respond to a different chapter challenge.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Mass Production",
    "description": "Participants manufacture a marketable product that addresses the annual theme. The development of the product prototype is documented in a portfolio that presents participant knowledge and skills related to the mass production process. Through a demonstration of the prototype and an interview, semifinalists support the viability of the prototype.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Mechanical Engineering",
    "description": "Participants design, document, and build a mechanical device (working catapult) that incorporates the elements of the annual theme/problem. Finalists are determined based on an evaluation of the documentation portfolio and participation in a head-to-head bracket.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Medical Technology",
    "description": "Participants conduct research on a contemporary medical technology issue related to the annual theme, document their research, create a display, and build a prototype. Semifinalists deliver a presentation about their entry and participate in an interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Microcontroller Design",
    "description": "To address the annual theme/problem, participants design and create a working digital device, document the development process, and demonstrate their product as part of a presentation.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Off the Grid",
    "description": "In response to the annual theme, participants conduct research on a sustainable architectural design for a home in a specified country. They then produce a portfolio and create a display and a model. Semifinalists present their design and participate in an interview.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Prepared Speech",
    "description": "Participants deliver a timed speech that relates to the theme of the current national TSA conference. Semifinalists and finalists are determined using the same competition procedure.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Problem Solving",
    "description": "Participants use problem-solving skills to design and build a solution to an onsite challenge. Solutions are evaluated using measures appropriate to the challenge, such as elapsed time, horizontal or vertical distance, and/or strength.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Promotional Marketing",
    "description": "Participants create and submit a marketing portfolio and required elements that address the annual theme/problem. Semifinalists complete a layout and design assignment for evaluation.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Robotics",
    "description": "Participants design, build, document, and test a robot assembled using open-sourced parts according to stated specifications and to meet the challenge of the yearly theme/problem.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Solar Racer",
    "description": "Participants apply STEM concepts, creativity, teamwork, and problem-solving skills to design, construct, and race a solar-powered model car. Documentation of the process is required.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "STEM Animation",
    "description": "Participants design and create a STEM animation video and documentation portfolio to address the annual theme/problem. Semifinalists present their animation and explain the elements of their portfolio/entry.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Structural Engineering",
    "description": "Participants apply the principles of structural engineering to design and construct a structure that complies with the annual challenge. An assessment of the required documentation and the destructive testing of the structure (to determine its design efficiency) determine both semifinalists and finalists.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "System Control Technology",
    "description": "In response to a challenge presented onsite at the conference, participants analyze a problem (typically one in an industrial setting), build and program a computer-controlled mechanical model to solve the problem, explain the program and the features of the mechanical model solution, and provide instructions for evaluators to operate the device.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Tech Bowl",
    "description": "Participants demonstrate their knowledge of TSA and concepts addressed in technology content standards by completing a written, objective test. Semifinalists participate in a head-to-head, team competition.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Technical Design",
    "description": "Participants demonstrate their ability to use the technical design process to solve an engineering design problem provided onsite at the conference. Required elements of the entry are presented in a portfolio that includes technical drawings for a minimum of three viable solutions.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Video Game Design",
    "description": "Participants design, build, provide documentation for, and launch an E-rated, online game on a subject of their choice. Onsite at the conference, semifinalists deliver a presentation and participate in an interview to demonstrate the knowledge and expertise gained during the development of the game.",
    "theme": {
      "text": "See TSA annual theme"
    }
  },
  {
    "name": "Website Design",
    "description": "To address the annual challenge, participants design, build, provide documentation for, and launch a website that incorporates the elements of website design, graphic layout, and proper coding techniques. Semifinalists participate in an interview to demonstrate the knowledge and expertise gained during the development of the website.",
    "theme": {
      "text": "See TSA annual theme"
    }
  }
]
